INSERT INTO departments (name)
VALUES ('Кафедра математики'),
       ('Кафедра информатики'),
       ('Кафедра физики'),
       ('Кафедра истории'),
       ('Кафедра биологии'),
       ('Кафедра химии'),
       ('Кафедра экономики');

INSERT INTO buildings (name)
VALUES ('Корпус 1'),
       ('Корпус 2'),
       ('Корпус 3'),
       ('Корпус 4'),
       ('Корпус 5'),
       ('Корпус 6');

INSERT INTO classrooms (building_id, number)
VALUES (1, '1-1'),
       (1, '1-2'),
       (1, '1-3'),
       (1, '1-4'),
       (1, '1-5'),
       (1, '1-6'),
       (1, '1-7'),
       (1, '1-8'),
       (1, '1-9'),
       (1, '1-10'),
       (1, '2-1'),
       (1, '2-2'),
       (1, '2-3'),
       (1, '2-4'),
       (1, '2-5'),
       (1, '2-6'),
       (1, '2-7'),
       (1, '2-8'),
       (1, '2-9'),
       (1, '2-10'),
       (1, '3-1'),
       (1, '3-2'),
       (1, '3-3'),
       (1, '3-4'),
       (1, '3-5'),
       (1, '3-6'),
       (1, '3-7'),
       (1, '3-8'),
       (1, '3-9'),
       (1, '3-10');


INSERT INTO teachers (full_name, department_id)
VALUES ('Иванов Петр Сергеевич', 1),
       ('Смирнова Ольга Владимировна', 1),
       ('Козлов Игорь Николаевич', 1),
       ('Петрова Анна Дмитриевна', 2),
       ('Сидоров Максим Андреевич', 2),
       ('Васильева Елена Игоревна', 2),
       ('Николаев Дмитрий Александрович', 3),
       ('Федорова Марина Викторовна', 3);

INSERT INTO subjects (name)
VALUES ('Высшая математика'),
       ('Программирование на Python'),
       ('Квантовая физика'),
       ('История древних цивилизаций'),
       ('Генетика и селекция'),
       ('Органическая химия'),
       ('Макроэкономика'),
       ('Теория алгоритмов'),
       ('Аналитическая геометрия'),
       ('Базы данных'),
       ('Философия науки'),
       ('Экология и устойчивое развитие');

INSERT INTO users (username, password_hash, role)
VALUES ('admin_gomel', 'admin_hash', 'admin'),
       ('manager_uni', 'manager_hash', 'manager');

INSERT INTO subscriptions (telegram_chat_id, group_id)
VALUES (123456781, 8),
       (123456782, 8),
       (123456783, 8);

INSERT INTO schedules (group_id, subject_id, teacher_id, classroom_id, date, start_time, end_time)
VALUES (1, 1, 1, 1, '2023-09-01', '08:00', '09:35'),
       (2, 2, 4, 5, '2023-09-01', '10:00', '11:35'),
       (3, 3, 7, 10, '2023-09-02', '13:00', '14:35');